/**
 * Created by pekko1215 on 2017/07/15.
 */
var YakuData = [{
        name: "はずれ",
        pay: [0, 0, 0]
    },
    {
        name: "リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "6枚役",
        pay: [4, 15, 15]
    },
    {
        name: "6枚役",
        pay: [4, 15, 15]
    },
    {
        name: "6枚役",
        pay: [4, 15, 15]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "ボーナス小役",
        pay: [0, 15, 0]
    },
    {
        name: "スイカ",
        pay: [6, 15, 15]
    },
    {
        name: '赤7',
        pay: [0, 0, 0]
    },
    {
        name: '青7',
        pay: [0, 0, 0]
    },
    {
        name: 'BAR',
        pay: [0, 0, 0]
    },
    {
        name: '1枚役A',
        pay: [1, 0, 0]
    },
    {
        name: "ボーナス小役",
        pay: [0, 15, 0]
    },
    {
        name: '1枚役B',
        pay: [1, 0, 0]
    },
    {
        name: "ボーナス小役",
        pay: [0, 14, 8]
    },
    {
        name: "ボーナス小役",
        pay: [0, 14, 8]
    },
    {
        name: "チェリー",
        pay:[2,0,0]
    },{
        name:'REG',
        pay:[0,0,0]
    },{
        name:'REG小役',
        pay:[0,0,8]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    }
]